lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
        #ifdef STACK_SIZE_CHK
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
        if(uxHighWaterMark2<stack_left)
        {
            stack_left=uxHighWaterMark2;
            printf("TCS WR STACK LEFT : %d\r\n",uxHighWaterMark2);
        }
        #endif
    }
}

static void led_toggle_thread(void * pvParameter)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    UNUSED_PARAMETER(pvParameter);
    while (true)
    {
        bsp_board_led_invert(BSP_BOARD_LED_0);
        vTaskDelay(1000);

        #ifdef STACK_SIZE_CHK
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
        if(uxHighWaterMark2<stack_left)
        {
            stack_left=uxHighWaterMark2;
            printf("LED stack left : %d\r\n",uxHighWaterMark2);
        }
        #endif
    }
}

static void tcs_read_rgbc_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    tcs34725_rgbc_data_t tcs_rgbc_thread;
    
    while(1)
    {
        tcs34725_read_rgbc(&tcs34725_instance,&tcs_rgbc_thread,tcs34725_rgbc_cb);
        vTaskDelay(200);

        #ifdef STACK_SIZE_CHK
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
        if(uxHighWaterMark2<stack_left)
        {
            stack_left=uxHighWaterMark2;
            printf("rgbc read stack left : %d\r\n",uxHighWaterMark2);
        }
        #endif
    }
}

static void ble_tcs_rgbc_send_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    ret_code_t err_code;
    tcs34725_rgbc_data_t ble_tcs_send_rgb;
    char data_array[18]={};
    uint16_t length=sizeof(data_array);

    while(1)
    {
        if(ulTaskNotifyTake(pdTRUE,10)!=0)
        {
            if(pdPASS!=xQueueReceive(m_tcs_rgb_data_queue, &ble_tcs_send_rgb, 10))
            {
                //fail
            }

            sprintf(data_array,"RGB%5d%3d%3d%3d",ble_tcs_send_rgb.clear,ble_tcs_send_rgb.red,ble_tcs_send_rgb.green,
                    ble_tcs_send_rgb.blue);
            if(m_conn_handle!=BLE_CONN_HANDLE_INVALID)
            {
                err_code=ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            #ifdef STACK_SIZE_CHK
            uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
            if(uxHighWaterMark2<stack_left)
            {
                stack_left=uxHighWaterMark2;
                printf("BLE rgbc stack left : %d\r\n",uxHighWaterMark2);
            }
            #endif
        }
    }
}

static void ble_tcs_reg_send_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    ret_code_t err_code;
    tcs34725_ble_reg_t ble_tcs_send_reg;
    uint16_t length=sizeof(ble_tcs_send_reg);

    while(1)
    {
//        if(ulTaskNotifyTake(pdTRUE,10)!=0)
        if(ulTaskNotifyTake(pdFALSE,10)!=0)
        {
            if(pdPASS!=xQueueReceive(m_tcs_reg_data_queue, &ble_tcs_send_reg, 10))
            {
                //fail
            }
            if(m_conn_handle!=BLE_CONN_HANDLE_INVALID)
            {
                err_code=ble_nus_data_send(&m_nus, ble_tcs_send_reg.send_data, &length, m_conn_handle);
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            #ifdef STACK_SIZE_CHK
            uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
            if(uxHighWaterMark2<stack_left)
            {
                stack_left=uxHighWaterMark2;
                printf("BLE reg send stack left : %d\r\n",uxHighWaterMark2);
            }
            #endif
        }
    }
}

/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook( void )
{
#if NRF_LOG_ENABLED
     vTaskResume(m_logger_thread);
#endif
}

/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}

#if NRF_LOG_ENABLED
static void logger_thread(void * arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif

static void task_create_func(void)
{
    
    if(pdPASS!=xTaskCreate(tcs_read_rgbc_thread, "TCS_RGBC_READ", configMINIMAL_STACK_SIZE+60, 
                           NULL, 3, &m_tcs_read_rgbc_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    if(pdPASS!=xTaskCreate(tcs_wr_reg_thread, "TCS_WR_REG", configMINIMAL_STACK_SIZE+160, 
                           NULL, 3, &m_tcs_wr_reg_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
    if(pdPASS!=xTaskCreate(ble_tcs_rgbc_send_thread, "TCS_RGBC_BLE_SEND", configMINIMAL_STACK_SIZE+60, 
                           NULL, 3, &m_ble_tcs_rgbc_send_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    if(pdPASS!=xTaskCreate(ble_tcs_reg_send_thread, "TCS_REG_BLE_SEND", configMINIMAL_STACK_SIZE+60,
                           NULL, 3, &m_ble_tcs_reg_send_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#if NRF_LOG_ENABLED
    if (pdPASS!=xTaskCreate(logger_thread, "LOGGER", configMINIMAL_STACK_SIZE+250, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif
}

