lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
static void queue_create_func(void)
{
    m_tcs_reg_data_queue=xQueueCreate(8,sizeof(tcs34725_ble_reg_t));
    m_tcs_rgb_data_queue=xQueueCreate(1,sizeof(tcs34725_rgbc_data_t));
    m_tcs_cmd_queue=xQueueCreate(8, sizeof(tcs34725_cmd_t));
}

void tcs34725_start()
{
    ret_code_t err_code;

    err_code=tcs34725_init(&tcs34725_instance);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_timing(&tcs34725_instance, 150);  //1~256
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_wait_time(&tcs34725_instance, 50);   //1~256
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_persistence(&tcs34725_instance, TCS34725_OUT_OF_RANGE_60);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_gain(&tcs34725_instance, TCS34725_GAIN_60x);
    APP_ERROR_CHECK(err_code);

//    err_code=tcs34725_set_wait_long(&tcs34725_instance, TCS34725_WAIT_LONG_ENABLE);
//    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_threshold(&tcs34725_instance, TCS34725_THRESHOLD_LOW, 10000);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_threshold(&tcs34725_instance, TCS34725_THRESHOLD_HIGH, 65535);
    APP_ERROR_CHECK(err_code);
}

void tcs34725_read_config()
{
    ret_code_t err_code;

    tcs34725_read_all_config(&tcs34725_instance, tcs34725_read_reg_cb);

    err_code=tcs34725_read_threshold(&tcs34725_instance, TCS34725_THRESHOLD_LOW, tcs34725_read_thr_cb);
    APP_ERROR_CHECK(err_code);
    nrf_delay_ms(10);
    err_code=tcs34725_read_threshold(&tcs34725_instance, TCS34725_THRESHOLD_HIGH, tcs34725_read_thr_cb);
    APP_ERROR_CHECK(err_code);
}


void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    if(pin==TCS34725_INT_PIN)
    {
        ret_code_t err_code;
        int queue_space;
        static tcs34725_ble_reg_t tcs_int_alarm={0};
        strcpy(tcs_int_alarm.send_data,"INT");
        NRF_LOG_INFO("TCS34725 RGBC Interrupt occured");
        err_code=tcs34725_int_clear(&tcs34725_instance);
        APP_ERROR_CHECK(err_code);
        if(err_code==NRF_SUCCESS)
        {
            NRF_LOG_INFO("TCS34725 Clear channel interrupt clear");
        }
        
        
        if(uxQueueSpacesAvailable(m_tcs_reg_data_queue)!=0) //The number of free spaces available in the queue.
        {
            if(pdPASS!=xQueueSend(m_tcs_reg_data_queue,&tcs_int_alarm,10))
            {
                //queue send fail
            }
        }
        else    //queue full
        {
            if(pdPASS!=xQueueOverwrite(m_tcs_reg_data_queue,&tcs_int_alarm))
            {
                //queue send fail
            }
        }
        xTaskNotifyGive(m_ble_tcs_reg_send_thread);
    }
}

static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrf_drv_gpiote_in_init(TCS34725_INT_PIN, &in_config, in_pin_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(TCS34725_INT_PIN, true);
}

int tcs34725_per_bintodec(tcs34725_persistence_t bit_value)
{
    uint8_t dec_value;
    switch(bit_value)
    {
        case TCS34725_OUT_OF_RANGE_0 :
            dec_value=0;
            break;
        case TCS34725_OUT_OF_RANGE_1 :
            dec_value=1;
            break;
        case TCS34725_OUT_OF_RANGE_2 :
            dec_value=2;
            break;
        case TCS34725_OUT_OF_RANGE_3 :
            dec_value=3;
            break;
        case TCS34725_OUT_OF_RANGE_5 :
            dec_value=5;
            break;
        case TCS34725_OUT_OF_RANGE_10 :
            dec_value=10;
            break;
        case TCS34725_OUT_OF_RANGE_15 :
            dec_value=15;
            break;
        case TCS34725_OUT_OF_RANGE_20 :
            dec_value=20;
            break;
        case TCS34725_OUT_OF_RANGE_25 :
            dec_value=25;
            break;
        case TCS34725_OUT_OF_RANGE_30 :
            dec_value=30;
            break;
        case TCS34725_OUT_OF_RANGE_35 :
            dec_value=35;
            break;
        case TCS34725_OUT_OF_RANGE_40 :
            dec_value=40;
            break;
        case TCS34725_OUT_OF_RANGE_45 :
            dec_value=45;
            break;
        case TCS34725_OUT_OF_RANGE_50 :
            dec_value=50;
            break;
        case TCS34725_OUT_OF_RANGE_55 :
            dec_value=55;
            break;
        case TCS34725_OUT_OF_RANGE_60 :
            dec_value=60;
            break;
        default :
            dec_value=0;
            break;
    }
    return dec_value;
    
}

tcs34725_persistence_t tcs34725_per_dectobin(uint8_t dec_value)
{
    tcs34725_persistence_t bin_value;
    switch(dec_value)
    {
        case 0 :
            bin_value=TCS34725_OUT_OF_RANGE_0;
            break;
        case 1 :
            bin_value=TCS34725_OUT_OF_RANGE_1;
            break;
        case 2 :
            bin_value=TCS34725_OUT_OF_RANGE_2;
            break;
        case 3 :
            bin_value=TCS34725_OUT_OF_RANGE_3;
            break;
        case 5 :
            bin_value=TCS34725_OUT_OF_RANGE_5;
            break;
        case 10 :
            bin_value=TCS34725_OUT_OF_RANGE_10;
            break;
        case 15 :
            bin_value=TCS34725_OUT_OF_RANGE_15;
            break;
        case 20 :
            bin_value=TCS34725_OUT_OF_RANGE_20;
            break;
        case 25 :
            bin_value=TCS34725_OUT_OF_RANGE_25;
            break;
        case 30 :
            bin_value=TCS34725_OUT_OF_RANGE_30;
            break;
        case 35 :
            bin_value=TCS34725_OUT_OF_RANGE_35;
            break;
        case 40 :
            bin_value=TCS34725_OUT_OF_RANGE_40;
            break;
        case 45 :
            bin_value=TCS34725_OUT_OF_RANGE_45;
            break;
        case 50 :
            bin_value=TCS34725_OUT_OF_RANGE_50;
            break;
        case 55 :
            bin_value=TCS34725_OUT_OF_RANGE_55;
            break;
        case 60 :
            bin_value=TCS34725_OUT_OF_RANGE_60;
            break;
        default :
            bin_value=0;
            break;
    }
    return bin_value;
}

int main(void)
{
    ret_code_t err_code;
    bool erase_bonds;
    // Initialize.
    uart_init();
    log_init();
    bsp_board_init(BSP_INIT_LEDS);
    clock_init();
    timers_init();
    gpio_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();

    twi_config();
    err_code=nrf_twi_sensor_init(&sensor_instance);
    APP_ERROR_CHECK(err_code);

    queue_create_func();
    task_create_func();
    
    tcs34725_start();
//    tcs34725_read_config();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    NRF_LOG_FLUSH();
    
    nrf_sdh_freertos_init(advertising_start,&erase_bonds);
    vTaskStartScheduler();

    // Enter main loop.
    for (;;)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
    }
}


/**
 * @}
 */
